{
  "Dracule Mihawk": {
    "name": "Hawk Eyes Mihawk",
    "Description": "Dracule Hawk Eyes Mihawk is the world’s strongest swordsman and a former Warlord of the Sea. He now co-leads the Cross Guild with Crocodile. Once known as the Marine Hunter, Mihawk had a legendary rivalry with Emperor Shanks. He trained Roronoa Zoro during the timeskip on Kuraigana Island. Mihawk was cloned as S-Hawk by Vegapunk to replace the Warlord system. Seen as Zoro’s ultimate goal, Mihawk acted as a supporting antagonist in the Baratie Arc and a major opponent during the Marineford War, where he fought alongside the Marines.",
    "Affiliations": "Cross Guild; Seven Warlords of the Sea (former)",
    "Occupations": "Pirate; Cross Guild Chief Officer; Warlord of the Sea (former)",
    "Residence": "Kuraigana Island (former); Karai Bari Island",
    "Epithet": "\"Hawk Eyes Mihawk\" \"Strongest Swordsman in the World\" \"Marine Hunter\"",

    "Bounty": [
      {
        "value": "3,590,000,000",
        "label": "current"
      }
    ],
    "Appearance": "Mihawk is a tall, lean, and muscular man with a fair complexion and short-cropped, jet-black hair that is slicked back, as well as a short beard, mustache, and sideburns that point upwards in a V shape. His nickname comes from his strangely colored eyes: red in the manga, yellow in the anime, which resemble a hawk's eyes due to the concentric ring present around each pupil.",
    "Personality": "Mihawk is mostly very serious, only having been seen laughing twice so far in the whole series. He rarely smiles or shows evident surprise, taking most developments in stride, and never showcases emotion on the battlefield, even when something unexpected happens.",
    "Item": [
      {
        "name": "Yoru",
        "type": "Sword",
        "description": "Mihawk's sword, Yoru, is one of the twelve Supreme Grade swords and is considered the strongest sword in the world. It is a black blade with a cross-shaped hilt."
      }
    ],
    "Abilities": [
      {
        "Swordsmanship": "Mihawk is known as the 'Strongest Swordsman in the World' and possesses unparalleled swordsmanship skills, able to cut through almost anything with ease.",

        "Observation Haki": "Mihawk has shown advanced mastery of Observation Haki, allowing him to sense the presence and intentions of others even from a distance.",

        "Busoshoku Haki": "He can use Busoshoku Haki to enhance his attacks and defend against other powerful attacks."
      }
    ],

    "Main Keywords": [
      "Dracule Mihawk",
      "Hawk Eyes",
      "Strongest Swordsman",
      "Cross Guild",
      "Warlord of the Sea",
      "Kuraigana Island",
      "Karai Bari Island",
      "Paramecia",
      "Zoan",
      "Mythical",
      "Gomu Gomu no Mi"
    ]
  },
  "Bartholomew Kuma": {
    "name": "Bartholomew Kuma",
    "Description": "Bartholomew Kuma is a former Warlord of the Sea, ex-king of the Sorbet Kingdom, and a founding officer of the Revolutionary Army with a bounty of 296 million. A feared pirate known as the Tyrant, Kuma was actually an ally to the Straw Hats. He became a cyborg Pacifista in exchange for curing his adoptive daughter Jewelry Bonney's illness, losing his free will in the process. A member of the rare Buccaneer race, Kuma was enslaved twice by the World Nobles but was freed by the Revolutionaries. Though perceived as an antagonist in several arcs, he secretly protected the Straw Hats and played a pivotal role in enabling their growth during the timeskip. He later becomes a major ally again during the Egghead Arc",
    "Affiliations": "Freedom Fighters (former); Pacifista; Revolutionary Army; Seven Warlords of the Sea (former); Sorbet Kingdom (former)",
    "Occupations": "Army Commander of the Revolutionary Army; Slave (former); Warlord of the Sea (former); King of Sorbet Kingdom (former); Pastor (former)",
    "Origin": "South Blue ( Sorbet Kingdom )",
    "Residence": "Sorbet Kingdom (former); Baltigo (former); Egghead (former, temporary); Mary Geoise (former); Sabaody Archipelago (former, temporary)",
    "Epithet": "\"Tyrant\" \"Pacifist\" \"Hero\"",

    "Devil Fruit": [
      {
        "Japanese Name": "Nikyu Nikyu no Mi",
        "English Name": "Ursus Shock",
        "Meaning": "Paw-Paw Fruit",
        "Type": "Paramecia"
      }
    ],
    "Appearance": "Kuma is a large, imposing figure with a bear-like appearance. He has a muscular build, covered in dark fur, and wears a long coat with a cross symbol on the back. His eyes are small and beady, and he has a distinctive scar across his face.",
    "Personality": "Kuma is known for his stoic and calm demeanor. He is fiercely loyal to the Revolutionary Army and has a strong sense of justice. Despite his intimidating appearance, he has shown kindness and compassion, especially towards his adoptive daughter, Jewelry Bonney.",
    "Item": [
      {
        "name": "Pacifista",
        "type": "Cyborg",
        "description": "Kuma has been transformed into a cyborg known as a Pacifista, which enhances his physical abilities and allows him to use powerful laser attacks."
      }
    ],
    "Abilities": [
      {
        "name": "Nikyu Nikyu no Mi",
        "description": "Kuma's Devil Fruit ability allows him to repel anything he touches, including physical objects and even pain. He can also use it to teleport himself and others."
      },
      {
        "name": "Haki",
        "description": "Kuma has shown the ability to use Busoshoku Haki, which allows him to enhance his attacks and defend against other powerful attacks."
      }
    ],
    "Main Keywords": [
      "Bartholomew Kuma",
      "Tyrant",
      "Pacifista",
      "Revolutionary Army",
      "Sorbet Kingdom",
      "Jewelry Bonney",
      "Paramecia",
      "Nikyu Nikyu no Mi"
    ]
  },
  "Boa Hancock": {
    "name": "Boa Hancock",
    "Description": "Boa Hancock, known as the Pirate Empress, is the captain of the Kuja Pirates and ruler of Amazon Lily. She was the only female Warlord of the Sea before the group’s disbandment. Formerly enslaved by the Celestial Dragons, she gained the powers of the Mero Mero no Mi. After escaping with her sisters, she rose to power on her island. Though initially hostile toward Luffy, she later fell in love with him and became a key ally—helping him during the Impel Down infiltration, Marineford War, his two-year training, and eventual reunion with his crew.",
    "Affiliations": "Kuja ( Kuja Pirates ); Seven Warlords of the Sea (former)",
    "Occupations": "Pirate Captain; Empress of Amazon Lily; Warlord of the Sea (former); Slave (former)",
    "Origin": "Calm Belt (Amazon Lily)",
    "Residence": "Amazon Lily Mary Geoise (former)",
    "Epithet": "\"Snake Princess\"; \"Pirate Empress\"",
    "Devil Fruit": [
      {
        "Japanese Name": "Mero Mero no Mi",
        "English Name": "Love-Love Fruit",
        "Meaning": "Mero Mero no Mi",
        "Type": "Paramecia"
      }
    ],
    "Appearance": "Hancock is considered the most beautiful person in the world. She has a more conventionally-proportioned figure compared to her abnormal and huge sisters. She is very tall and slender with long black hair that extends past her waist with locks of hair that frame her face down to her chin and shows off her high forehead, dark brown (dark blue in the anime) eyes with long, voluminous eyelashes and pale skin. She has a narrow waist and very large breasts, and a pair of large golden serpent earrings.",
    "Personality": "Hancock is a very complex woman. At first glance, she appears to be selfish, pompous, spoiled, and used to having her own way. She can also act arrogant and cruel, usually justifying her less-than-admirable actions with her unmatched beauty, causing her to think that she can get away with anything because the world will forgive her (and save for the handful able to resist she is largely successful in this approach, as gleeful suitors of both genders happily forgive her every transgression)",
    "Item": [
      {
        "name": "Snake Princess",
        "type": "Title",
        "description": "Hancock is known as the 'Snake Princess' due to her heritage and her ability to turn people into stone with her Devil Fruit power."
      }
    ],
    "Abilities": [
      {
        "name": "Mero Mero no Mi",
        "description": "Hancock's Devil Fruit ability allows her to turn people into stone by making them feel lust or love towards her. She can also use it to create powerful stone constructs."
      },
      {
        "name": "Haki",
        "description": "Hancock has shown the ability to use Busoshoku Haki, which allows her to enhance her attacks and defend against other powerful attacks."
      }
    ],
    "Main Keywords": [
      "Boa Hancock",
      "Snake Princess",
      "Pirate Empress",
      "Kuja Pirates",
      "Amazon Lily",
      "Paramecia",
      "Mero Mero no Mi"
    ]
  },
  "Buggy": {
    "name": "Buggy the Star Clown",
    "Description": "Buggy the Star Clown is the captain of the Buggy Pirates and a former apprentice of the Roger Pirates alongside Shanks. Initially an early enemy of Luffy, his involvement in the Marineford War unintentionally boosted his reputation, leading to his appointment as a Warlord and the creation of Buggy's Delivery. After the system's dissolution, he co-founded the Cross Guild with Mihawk and Crocodile, becoming one of the Four Emperors. Though often comic relief, Buggy has become a major recurring character across multiple arcs and factions.",
    "Affiliations": "Cross Guild; Buggy's Delivery; Buggy Pirates; Buggy and Alvida Alliance; Four Emperors; Seven Warlords of the Sea (former); Roger Pirates (former); Impel Down (former)",
    "Occupations": "Pirate Captain; Emperor; Figurehead President of Cross Guild; Chairman of Buggy's Delivery (former); Warlord of the Sea (former); Apprentice (former); Prisoner of the Great Prison (former)",
    "Origin": "Grand Line",
    "Residence": "Karai Bari Island; Orange Town (former)",
    "Epithet": "\"Buggy the Clown\" \"Buggy the Star Clown\"",
    "Bounty": [
      {
        "value": "3,189,000,000",
        "label": "current"
      }
    ],
    "Devil Fruit": [
      {
        "Japanese Name": "Bara Bara no Mi",
        "English Name": "Chop-Chop Fruit",
        "Meaning": "Bara Bara no Mi",
        "Type": "Paramecia"
      }
    ],
    "Appearance": "Buggy is a tall man with an appearance resembling that of a clown, as to mirror his epithet. He has long blue hair, gray eyes (light blue in the manga) The big, red nose on his face is, in fact, his real nose. The blue tassels coming from the sides of his hat are his actual hair in the shape of two ponytails",
    "Personality": "Buggy is a cowardly and self-serving individual who often tries to avoid direct confrontation. He is known for his comedic antics and his tendency to exaggerate his own importance. Despite his cowardice, he has a knack for rallying people to his cause and has a surprisingly large following.",
    "Item": [
      {
        "name": "Chop-Chop Fruit",
        "type": "Devil Fruit",
        "description": "Buggy's Devil Fruit ability allows him to separate his body into pieces and control them independently, making him immune to most physical attacks."
      }
    ],
    "Abilities": [
      {
        "Bara Bara no Mi": "Buggy's Devil Fruit ability allows him to separate his body into pieces and control them independently, making him immune to most physical attacks. He can also use it to create powerful shockwaves by clapping his hands together.",
        "Haki": "Buggy has shown the ability to use Busoshoku Haki, which allows him to enhance his attacks and defend against other powerful attacks."
      }
    ],
    "Main Keywords": [
      "Buggy the Clown",
      "Buggy Pirates",
      "Cross Guild",
      "Paramecia",
      "Bara Bara no Mi",
      "Chop-Chop Fruit"
    ]
  },
  "Crocodile": {
    "name": "Crocodile",
    "Description": "Sir Crocodile, also known as Desert King, is a former Warlord and leader of the Baroque Works crime syndicate, where he secretly plotted to take over Arabasta. After being defeated by the Straw Hats, he was stripped of his title and imprisoned in Impel Down. Freed by Luffy during the Impel Down breakout, he fought in the Summit War and later escaped with Daz Bonez. Crocodile is now a co-founder of the Cross Guild alongside Mihawk, operating under the public leadership of Buggy. He has also been cloned as a Seraphim by Vegapunk.",
    "Affiliations": "Cross Guild; Seven Warlords of the Sea (former); Baroque Works (former); Impel Down (former)",
    "Occupations": "Pirate; Cross Guild Chief Officer; Baroque Works President (former); Proprietor of Rain Dinners (former); Prisoner of the Great Prison (former)",
    "Origin": "Grand Line",
    "Residence": "Rainbase , Arabasta (former)",
    "Epithet": "\"Sir Crocodile\" \"Desert King\"",
    "Bounty": [
      {
        "value": "1,965,000,000",
        "label": "current"
      }
    ],
    "Devil Fruit": [
      {
        "Japanese Name": "Suna Suna no Mi",
        "English Name": "Sand-Sand Fruit",
        "Meaning": "Suna Suna no Mi",
        "Type": "Logia"
      }
    ],
    "Appearance": "Crocodile is a tall man with a wide chest, broad shoulders, and a thick neck. He has pale skin and nape-length black hair, which is kept neatly slicked back, though strands tend to fall in front of his face during battles. Crocodile has various battle wounds, most notably a long-stitched scar at the bridge of his nose that stretches across his face and a large hook made from a tough gold alloy in place of his left hand. His black eyes (orange in the manga) are deep-set and heavy-lidded his eyes can be seems as white within black pupils in the anime",
    "Personality": "Crocodile is a ruthless and cunning individual who will stop at nothing to achieve his goals. He is highly intelligent and strategic, often manipulating others to do his bidding. Despite his cold demeanor, he has a sense of honor and respects those who can match his strength.",
    "Item": [
      {
        "name": "Hook",
        "type": "Weapon",
        "description": "Crocodile's left hand is replaced with a hook made from a tough gold alloy, which he uses as a weapon in combat."
      }
    ],
    "Abilities": [
      {
        "Haki": "Crocodile has shown the ability to use Busoshoku Haki, which allows him to enhance his attacks and defend against other powerful attacks."
      }
    ],
    "Main Keywords": [
      "Crocodile",
      "Desert King",
      "Baroque Works",
      "Cross Guild",
      "Logia",
      "Suna Suna no Mi",
      "Sand-Sand Fruit"
    ]
  },
  "Gecko Moria": {
    "name": "Gecko Moria",
    "Description": "Gecko Moria is the captain of the Thriller Bark Pirates and a former Warlord of the Sea with a frozen bounty of 320,000,000. After losing his crew in a battle with Kaidou, he turned to creating a zombie army using the Kage Kage no Mi, clashing with the Straw Hats at Thriller Bark. Though defeated, he retained his Warlord status and fought in the Summit War, later being stripped of his title and targeted for elimination by Doflamingo. Moria escaped to the New World, was cloned as a Seraphim by Vegapunk, and later imprisoned by Blackbeard after refusing to join him. He was eventually rescued by Perona with Koby’s help.",
    "Affiliations": "Thriller Bark Pirates ( Mysterious Four ); Seven Warlords of the Sea (former); Gecko Pirates (former)",
    "Occupations": "Pirate Captain; Warlord of the Sea (former)",
    "Origin": "West Blue",
    "Residence": "Florian Triangle (former); Thriller Bark",
    "Bounty": [
      {
        "value": "320,000,000",
        "label": "current"
      }
    ],
    "Devil Fruit": [
      {
        "Japanese Name": "Kage Kage no Mi",
        "English Name": "Shadow-Shadow Fruit",
        "Meaning": "Kage Kage no Mi",
        "Type": "Paramecia"
      }
    ],
    "Appearance": "Moria is an abnormally large humanoid creature with very distinct, devil-like features.[16] Standing at 692 cm (22'8½) in height, he was the tallest among the Seven Warlords of the Sea.He has two horns protruding from the sides of his forehead and stitches running vertically from the top of his face and down his neck, which is rather long and thick in comparison to his body. His ears and teeth are both pointed, while his lower body is relatively fat and stubby in comparison.Moria's hair is extremely short and spiky it's a dark red color (reddish-purple in the anime), and his skin is a pale blue, matching his lips, armbands and the edges of his gloves. His coat and gloves are black, while his pants are bright orange with pale window shapes imprinted on them. ",
    "Personality": "Moria is a very arrogant and self-centered individual, believing himself to be the most powerful pirate in the world. He is also quite sadistic, taking pleasure in tormenting his enemies and using their shadows to create his own army of zombies.",
    "Item": [
      {
        "name": "Shadow Asgard",
        "type": "Weapon",
        "description": "Moria wields a large sword called Shadow Asgard, which he uses to control the shadows of others and create powerful attacks."
      }
    ],
    "Abilities": [
      {
        "name": "Kage Kage no Mi",
        "description": "Moria's Devil Fruit ability allows him to manipulate shadows, creating an army of zombies and controlling their movements. He can also steal shadows from others, making them weak and unable to fight."
      },
      {
        "name": "Haki",
        "description": "Moria has shown the ability to use Busoshoku Haki, which allows him to enhance his attacks and defend against other powerful attacks."
      }
    ],
    "Main Keywords": [
      "Gecko Moria",
      "Thriller Bark",
      "Paramecia",
      "Kage Kage no Mi",
      "Shadow-Shadow Fruit",
      "Zombie Army",
      "Warlord of the Sea"
    ]
  },
  "Trafalgar D. Water Law": {
    "name": "Trafalgar D. Water Law",
    "Description": "Trafalgar D. Water Law, known as the Surgeon of Death, is the captain and doctor of the Heart Pirates and a member of the Worst Generation. A survivor of Flevance’s Amber Lead Syndrome tragedy, Law escaped as a child and later joined, then broke away from, the Donquixote Pirates with help from Rosinante. He became a Warlord during the timeskip but lost the title after allying with the Straw Hats to defeat Doflamingo. Law seeks the One Piece and the truth behind the Will of D. His bounty rose from 200 million to 3 billion berries after helping defeat Big Mom in the Wano Arc.",
    "Affiliations": "Heart Pirates; Clan of D.; Ninja-Pirate-Mink-Samurai Alliance (disbanded); Seven Warlords of the Sea (revoked); Donquixote Pirates (defected)",
    "Occupations": "Pirate Captain; Doctor; Warlord of the Sea (former)",
    "Origin": "North Blue",
    "Residence": "Flevance (former); Spider Miles (former); Swallow Island (former)",
    "Epithet": "\"Surgeon of Death\"",
    "Bounty": [
      {
        "value": "3,000,000,000",
        "label": "current"
      }
    ],
    "Devil Fruit": [
      {
        "Japanese Name": "Ope Ope no Mi",
        "English Name": "Op-Op Fruit",
        "Meaning": "Ope Ope no Mi",
        "Type": "Paramecia"
      }
    ],
    "Appearance": "Law is a slim young man with tan skin and a very tall stature. He has faint shadows right under his yellow eyes (grey in the anime), and his face is usually seen with a smirk. He wears a northern-style fur hat, which is white and has a spotted pattern along the bottom and the bill. He has very short dark hair, a majority of which is obscured by his hat, save for his sideburns and a small goatee.[1] His hair color is depicted as black in both the anime and manga, though sometimes the manga depicts it as blue mistakenly.",
    "Personality": "Law is a calm and collected individual, often seen with a smirk on his face. He is highly intelligent and strategic, using his Devil Fruit powers to manipulate his surroundings and opponents. Despite his serious demeanor, he has a strong sense of justice and is willing to risk his life for his friends and allies.",
    "Item": [
      {
        "name": "Polar Tang",
        "type": "Ship",
        "description": "Law's submarine, Polar Tang, is a highly advanced vessel that allows him to travel underwater and evade detection."
      }
    ],
    "Abilities": [
      {
        "name": "Ope Ope no Mi",
        "description": "Law's Devil Fruit ability allows him to create a spherical area called a 'Room' where he can manipulate objects and people at will. He can also perform surgeries and transfer people's personalities into other bodies."
      },
      {
        "name": "Haki",
        "description": "Law has shown the ability to use Busoshoku Haki, which allows him to enhance his attacks and defend against other powerful attacks."
      }
    ],
    "Main Keywords": [
      "Trafalgar D. Water Law",
      "Surgeon of Death",
      "Heart Pirates",
      "Ope Ope no Mi",
      "Op-Op Fruit",
      "Paramecia",
      "Warlord of the Sea"
    ]
  },
  "Marshall D. Teach": {
    "name": "Marshall D. Teach",
    "Description": "Marshall D. Teach, known as Blackbeard, is the admiral of the Blackbeard Pirates and one of the Four Emperors. Secretly the son of Rocks D. Xebec, he is the only known person to wield two Devil Fruits: the Yami Yami no Mi (darkness) and Gura Gura no Mi (quake). Formerly a member of the Whitebeard Pirates, he betrayed them by killing Thatch for the Yami Yami no Mi and capturing Ace, earning Warlord status. He used this to infiltrate Impel Down and strengthen his crew with powerful inmates. At Marineford, he killed Whitebeard and stole his powers, securing his rise as an Emperor. Now based at Hachinosu, Teach aims to have it recognized as the Blackbeard Kingdom and is considered part of the Worst Generation.",
    "Affiliations": "Blackbeard Pirates; Four Emperors; Clan of D.; Seven Warlords of the Sea (former); Whitebeard Pirates 2nd Division (defected)",
    "Occupations": "Pirate; Admiral; Emperor; Apprentice (former); Warlord of the Sea (former)",
    "Origin": "Grand Line ( Shade Port )",
    "Residence": "Hachinosu",
    "Epithet": "\"Blackbeard\" (\"Black Beard\" in the edited dub)",
    "Bounty": [
      {
        "value": "3,996,000,000",
        "label": "current"
      }
    ],
    "Devil Fruit": [
      {
        "Japanese Name": "Yami Yami no Mi",
        "English Name": "Dark-Dark Fruit",
        "Meaning": "Yami Yami no Mi",
        "Type": "Logia"
      },
      {
        "Japanese Name": "Gura Gura no Mi",
        "English Name": "Quake-Quake Fruit",
        "Meaning": "Gura Gura no Mi",
        "Type": "Paramecia"
      }
    ],

    "Appearance": "Teach is a very tall man with dark skin, being exactly twice Luffy's (pre-timeskip) height. He has a massive build as his body is round with relatively thin limbs. He has a prominent lipped mouth with several broken or missing teeth a pronounced crooked nose and a very large and hairy chest and torso. Long, thick, woolly black hair falls down the back of his neck, underneath a black bandanna. He also has a black beard that grew around his jawline",
    "Personality": "Teach is a cunning and ruthless individual who will stop at nothing to achieve his goals. He is highly ambitious and seeks to become the Pirate King by any means necessary. Despite his cruel nature, he has a charismatic personality that allows him to rally others to his cause.",
    "Item": [
      {
        "name": "Blackbeard's Jolly Roger",
        "type": "Flag",
        "description": "The Blackbeard Pirates' flag features a skull with two crossed bones and a black beard, symbolizing their ruthless nature and ambition."
      }
    ],
    "Abilities": [
      {
        "Yami Yami no Mi": "Teach's first Devil Fruit ability allows him to create and control darkness, which can absorb other Devil Fruit powers and nullify their effects. He can also use it to create powerful shockwaves.",

        "Gura Gura no Mi": "Teach's second Devil Fruit ability allows him to create shockwaves that can cause massive destruction, even capable of splitting the sea and creating tsunamis.",

        "Haki": "Teach has shown the ability to use Busoshoku Haki, which allows him to enhance his attacks and defend against other powerful attacks."
      }
    ],
    "Main Keywords": [
      "Marshall D. Teach",
      "Blackbeard",
      "Four Emperors",
      "Blackbeard Pirates",
      "Logia",
      "Yami Yami no Mi",
      "Gura Gura no Mi",
      "Dark-Dark Fruit",
      "Quake-Quake Fruit"
    ]
  }
}
